#### [`repos-partners`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-XXJBsWAY82s9BURZ" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/79a872a9-7064-499d-94b8-2c9c6673019a/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-XXJBsWAY82s9BURZ

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...
data.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 3s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 will be created
  + resource "github_branch_protection" "repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-mongodbatlas"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F will be created
  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-mongodbatlas"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225 will be created
  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-mongodbatlas-go"
      + url        = (known after apply)
    }

  # github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5 will be created
  + resource "github_repository" "repospartners_cdktfprovidermongodbatlas_repo_B439CDB5" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for mongodbatlas."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-mongodbatlas"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "mongodbatlas",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063 will be created
  + resource "github_repository" "repospartners_cdktfprovidermongodbatlasgo_repo_718CC063" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "CDK for Terraform Go provider bindings for mongodbatlas."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-mongodbatlas-go"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "mongodbatlas",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA will be created
  + resource "github_repository_webhook" "repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-mongodbatlas"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE will be created
  + resource "github_repository_webhook" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-mongodbatlas-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A will be created
  + resource "github_team_repository" "repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-mongodbatlas"
      + team_id    = "6602018"
    }

  # github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904 will be created
  + resource "github_team_repository" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-mongodbatlas-go"
      + team_id    = "6602018"
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + repospartners_providerRepos_017B2065 = [
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-XXJBsWAY82s9BURZ%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.3.7%0Aon linux_amd64%0AInitializing plugins and modules...%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 3s [id=6602018]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "GO_GITHUB_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "PROJEN_GITHUB_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_PASSWORD"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_STAGING_PROFILE_ID"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_USERNAME"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "NPM_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "NUGET_API_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "TWINE_PASSWORD"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "TWINE_USERNAME"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 will be created%0A  + resource "github_branch_protection" "repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82" {%0A      + allows_deletions       = false%0A      + allows_force_pushes    = false%0A      + enforce_admins         = true%0A      + id                     = (known after apply)%0A      + pattern                = "main"%0A      + repository_id          = "cdktf-provider-mongodbatlas"%0A      + require_signed_commits = false%0A%0A      + required_status_checks {%0A          + contexts = [%0A              + "Validate PR title",%0A              + "build",%0A              + "package-dotnet",%0A              + "package-go",%0A              + "package-java",%0A              + "package-js",%0A              + "package-python",%0A            ]%0A          + strict   = true%0A        }%0A    }%0A%0A  # github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F will be created%0A  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F" {%0A      + color      = "5DC8DB"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "automerge"%0A      + repository = "cdktf-provider-mongodbatlas"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225 will be created%0A  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225" {%0A      + color      = "5DC8DB"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "automerge"%0A      + repository = "cdktf-provider-mongodbatlas-go"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5 will be created%0A  + resource "github_repository" "repospartners_cdktfprovidermongodbatlas_repo_B439CDB5" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + auto_init              = true%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = true%0A      + description            = "Prebuilt Terraform CDK (cdktf) provider for mongodbatlas."%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = true%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://cdk.tf"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "cdktf-provider-mongodbatlas"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + topics                 = [%0A          + "cdk",%0A          + "cdktf",%0A          + "mongodbatlas",%0A          + "pre-built-provider",%0A          + "provider",%0A          + "terraform",%0A          + "terraform-cdk",%0A        ]%0A      + visibility             = "public"%0A    }%0A%0A  # github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063 will be created%0A  + resource "github_repository" "repospartners_cdktfprovidermongodbatlasgo_repo_718CC063" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + auto_init              = true%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = true%0A      + description            = "CDK for Terraform Go provider bindings for mongodbatlas."%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = true%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://cdk.tf"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "cdktf-provider-mongodbatlas-go"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + topics                 = [%0A          + "cdk",%0A          + "cdktf",%0A          + "mongodbatlas",%0A          + "pre-built-provider",%0A          + "provider",%0A          + "terraform",%0A          + "terraform-cdk",%0A        ]%0A      + visibility             = "public"%0A    }%0A%0A  # github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA will be created%0A  + resource "github_repository_webhook" "repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA" {%0A      + active     = true%0A      + etag       = (known after apply)%0A      + events     = [%0A          + "issues",%0A        ]%0A      + id         = (known after apply)%0A      + repository = "cdktf-provider-mongodbatlas"%0A      + url        = (known after apply)%0A%0A      + configuration {%0A          + content_type = "json"%0A          + url          = (sensitive value)%0A        }%0A    }%0A%0A  # github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE will be created%0A  + resource "github_repository_webhook" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE" {%0A      + active     = true%0A      + etag       = (known after apply)%0A      + events     = [%0A          + "issues",%0A        ]%0A      + id         = (known after apply)%0A      + repository = "cdktf-provider-mongodbatlas-go"%0A      + url        = (known after apply)%0A%0A      + configuration {%0A          + content_type = "json"%0A          + url          = (sensitive value)%0A        }%0A    }%0A%0A  # github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A will be created%0A  + resource "github_team_repository" "repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "admin"%0A      + repository = "cdktf-provider-mongodbatlas"%0A      + team_id    = "6602018"%0A    }%0A%0A  # github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904 will be created%0A  + resource "github_team_repository" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "admin"%0A      + repository = "cdktf-provider-mongodbatlas-go"%0A      + team_id    = "6602018"%0A    }%0A%0APlan: 22 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + repospartners_providerRepos_017B2065 = [%0A      + (known after apply),%0A    ]%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-XXJBsWAY82s9BURZ%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.3.7%0Aon linux_amd64%0AInitializing plugins and modules...%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 3s [id=6602018]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "GO_GITHUB_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "PROJEN_GITHUB_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_PASSWORD"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_STAGING_PROFILE_ID"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "MAVEN_USERNAME"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "NPM_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "NUGET_API_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "TWINE_PASSWORD"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-mongodbatlas"%0A      + secret_name     = "TWINE_USERNAME"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 will be created%0A  + resource "github_branch_protection" "repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82" {%0A      + allows_deletions       = false%0A      + allows_force_pushes    = false%0A      + enforce_admins         = true%0A      + id                     = (known after apply)%0A      + pattern                = "main"%0A      + repository_id          = "cdktf-provider-mongodbatlas"%0A      + require_signed_commits = false%0A%0A      + required_status_checks {%0A          + contexts = [%0A              + "Validate PR title",%0A              + "build",%0A              + "package-dotnet",%0A              + "package-go",%0A              + "package-java",%0A              + "package-js",%0A              + "package-python",%0A            ]%0A          + strict   = true%0A        }%0A    }%0A%0A  # github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F will be created%0A  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F" {%0A      + color      = "5DC8DB"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "automerge"%0A      + repository = "cdktf-provider-mongodbatlas"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225 will be created%0A  + resource "github_issue_label" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225" {%0A      + color      = "5DC8DB"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "automerge"%0A      + repository = "cdktf-provider-mongodbatlas-go"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5 will be created%0A  + resource "github_repository" "repospartners_cdktfprovidermongodbatlas_repo_B439CDB5" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + auto_init              = true%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = true%0A      + description            = "Prebuilt Terraform CDK (cdktf) provider for mongodbatlas."%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = true%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://cdk.tf"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "cdktf-provider-mongodbatlas"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + topics                 = [%0A          + "cdk",%0A          + "cdktf",%0A          + "mongodbatlas",%0A          + "pre-built-provider",%0A          + "provider",%0A          + "terraform",%0A          + "terraform-cdk",%0A        ]%0A      + visibility             = "public"%0A    }%0A%0A  # github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063 will be created%0A  + resource "github_repository" "repospartners_cdktfprovidermongodbatlasgo_repo_718CC063" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + auto_init              = true%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = true%0A      + description            = "CDK for Terraform Go provider bindings for mongodbatlas."%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = true%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://cdk.tf"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "cdktf-provider-mongodbatlas-go"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + topics                 = [%0A          + "cdk",%0A          + "cdktf",%0A          + "mongodbatlas",%0A          + "pre-built-provider",%0A          + "provider",%0A          + "terraform",%0A          + "terraform-cdk",%0A        ]%0A      + visibility             = "public"%0A    }%0A%0A  # github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA will be created%0A  + resource "github_repository_webhook" "repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA" {%0A      + active     = true%0A      + etag       = (known after apply)%0A      + events     = [%0A          + "issues",%0A        ]%0A      + id         = (known after apply)%0A      + repository = "cdktf-provider-mongodbatlas"%0A      + url        = (known after apply)%0A%0A      + configuration {%0A          + content_type = "json"%0A          + url          = (sensitive value)%0A        }%0A    }%0A%0A  # github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE will be created%0A  + resource "github_repository_webhook" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE" {%0A      + active     = true%0A      + etag       = (known after apply)%0A      + events     = [%0A          + "issues",%0A        ]%0A      + id         = (known after apply)%0A      + repository = "cdktf-provider-mongodbatlas-go"%0A      + url        = (known after apply)%0A%0A      + configuration {%0A          + content_type = "json"%0A          + url          = (sensitive value)%0A        }%0A    }%0A%0A  # github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A will be created%0A  + resource "github_team_repository" "repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "admin"%0A      + repository = "cdktf-provider-mongodbatlas"%0A      + team_id    = "6602018"%0A    }%0A%0A  # github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904 will be created%0A  + resource "github_team_repository" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "admin"%0A      + repository = "cdktf-provider-mongodbatlas-go"%0A      + team_id    = "6602018"%0A    }%0A%0APlan: 22 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + repospartners_providerRepos_017B2065 = [%0A      + (known after apply),%0A    ]%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

*Pusher: @mutahhir, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*